resource/xml/payload_pagamento.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pag="http://sicredi.com.br/cobranca/pagamento/ws/v2/pagamentoBoleto/" xmlns:v2="http://sicredi.com.br/corporativo/negocio/movimento/cmodel/v2/" xmlns:v1="http://sicredi.com.br/contas/conta/cmodel/v1/" xmlns:v11="http://sicredi.com.br/corporativo/negocio/produto/cmodel/v1/" xmlns:v21="http://sicredi.com.br/cobranca/cmodel/v2/" xmlns:v12="http://sicredi.com.br/cobranca/boleto/cmodel/v1/">
   <soapenv:Header/>
   <soapenv:Body>
    <pag:regularizarBoletoCobranca>
         <pag:InRegularizarBoletoCobranca>
            <pag:OrigemMovimento>
               <v2:Cooperativa>0307</v2:Cooperativa>
               <v2:Posto>01</v2:Posto>
               <v2:Sistema>019</v2:Sistema>
               <v2:Usuario>IB</v2:Usuario>
            </pag:OrigemMovimento>
            <pag:ContaOrigem>
               <v1:codigoBanco>748</v1:codigoBanco>
               <v1:codigoAgencia>0101</v1:codigoAgencia>
               <v1:numero>97673</v1:numero>
              <v1:digitoVerificador>3</v1:digitoVerificador>
            </pag:ContaOrigem>
            <pag:ContaPagador>
               <v1:codigoBanco>748</v1:codigoBanco>
               <v1:codigoAgencia>0101</v1:codigoAgencia>
               <v1:numero>01014</v1:numero>
               <v1:digitoVerificador>6</v1:digitoVerificador>
           </pag:ContaPagador>
            <pag:ForcarLiquidacao></pag:ForcarLiquidacao>
            <pag:PagamentoCobranca ID="0">
               <v11:Codigo></v11:Codigo>
               <v11:Nome></v11:Nome>
               <v21:Valor>46.41</v21:Valor>
               <JurosMora></JurosMora>
               <Multa></Multa>
               <Desconto></Desconto>
               <Acrescimos></Acrescimos>
               <Abatimento></Abatimento>
               <PrazoBloqueioCheque></PrazoBloqueioCheque>
               <ContaDebito>
                  <v1:codigoBanco>748</v1:codigoBanco>
                  <v1:codigoAgencia></v1:codigoAgencia>
                  <v1:numero></v1:numero>
                  <v1:digitoVerificador></v1:digitoVerificador>
               </ContaDebito>
               <v21:Boleto>
                  <v12:CodigoBarras>74894820500000046411119100146703070158069101</v12:CodigoBarras>
                  <v12:LinhaDigitavel></v12:LinhaDigitavel>
                  <v12:Emissao></v12:Emissao>
                  <v12:TipoEmissao>BENEFICIARIO</v12:TipoEmissao>
                  <v12:Vencimento></v12:Vencimento>
                  <v12:ValorTitulo>46.41</v12:ValorTitulo>
                  <v12:NumeroDocumento></v12:NumeroDocumento>
                  <v12:DocumentoBeneficiario>87766507000139</v12:DocumentoBeneficiario>
                  <v12:DocumentoPagador>34971106049</v12:DocumentoPagador>
               </v21:Boleto>
            </pag:PagamentoCobranca>
            <pag:PrazoBloqueioCheque></pag:PrazoBloqueioCheque>
            <pag:TipoCanal>ATM</pag:TipoCanal>
            <pag:AceitaPagamentoDivergente>SIM</pag:AceitaPagamentoDivergente>
        </pag:InRegularizarBoletoCobranca>
      </pag:regularizarBoletoCobranca>

   </soapenv:Body>
</soapenv:Envelope>
